applications/solvers/cokeCombustionFoam/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Reference:
    Bui-Pham, M. N. (1992).
    Studies in structures of lam inar hydrocarbon flames.
    PhD Thesis, University of California, San Diego

Notes:
    This mechanism was developed for simulating this exact counter-flow flame
    configuration. It should not be considered general-purpose.

\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    O2
    N2
    CO2
);

reactions
{

}

customizedReactions
{
    cokeCombustion
    {
        type     irreversibleArrheniusReaction;
        odeSolver "4thRKFull";//4thRKFull,4thRK, 2ndRK,EulerImplicit
        reaction "coke + O2 = CO2";
        A        9.717e6; //m/s
        Ta       15767;
        hr       3.885e8; //J/kmol
    }

}


// ************************************************************************* //
