applications/solvers/cokeCombustionFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "epsCoke.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|h|e|Y.*)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|h|e|Y.*)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

}

// PIMPLE
// {
//     nNonOrthogonalCorrectors 0;
//     nCorrectors         2;
// }

PIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;
    nOuterCorrectors  10;

    outerCorrectorResidualControl
    {
        "(h|e)"    
        {
            tolerance  1e-6;
            relTol     0;
        }

        "Y.*"    
        {
            tolerance  1e-6;
            relTol     0;
        }

        p_rgh      
        {
            tolerance  1e-6;
            relTol     0;
        }
        
    }

    // p_rghRefCell          (2e-4 0 0); //the right bottome
    // p_rghRefValue         0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

// relaxationFactors
// {
//     equations
//     {
//         "Y.*"            0.7;
//         "(h|e)"            0.7;
//     }
//     equations
//     {
//         "Y.*Final"            1.0;
//         "(h|e)Final"            1.0;
//     }
// }

// ************************************************************************* //
